app/Http/Controllers/Front/NewsController.php

select * from `news` order by `created_at` desc limit 1
select count(*) as aggregate from `news`
---
    public function __invoke(Request $request)
    {
        $latest = News::latest()->first();
        if ($latest) {
            $news = News::where('id', '!=', $latest->id)->latest()->paginate(9);
        } else {
            $news = News::latest()->paginate(9);