app/Http/Controllers/Dashboard2Controller.php

select * from `announcements` order by `created_at` desc limit 1
---
    public function index(FacebookService $facebook){
        $urgent = Announcement::latest()->first();