app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `roles`
select count(*) as aggregate from `w_officers`
select count(*) as aggregate from `woreda`
select count(*) as aggregate from `news`
select count(*) as aggregate from `zone1s`
select count(*) as aggregate from `announcements`
---
    public function __invoke(Request $request)
    {
$zones = [];
$city = [];

for ($i = 1; $i <= 21; $i++) {
    $zones[] = "zone{$i}s";
}
for($a = 1; $a <=19; $a++){
    $city[] = "city{$a}s";
}
$roles = \DB::table('roles')->count();
$officers = \DB::table('w_officers')->count();

$all = collect($zones)->sum(fn($z) => \DB::table($z)->count());
$allcity = collect($city)->sum(fn($c) => \DB::table($c)->count());
$woreda = \DB::table('woreda')->count();


// Optional: return or dd
// dd($total);

        $news = News::count();
        $count = Zone1::count();
        $announcement = Announcement::count();
        $members = Zone1::count();

select `zone`, COUNT(name) AS total from `w_officers` group by `zone`
---
        }
    }

$zoneCounter = \DB::table('w_officers')
    ->select('zone', \DB::raw('COUNT(name) AS total'))
    ->groupBy('zone')
    ->pluck('total', 'zone')      // returns ["Sh/Kaaabaa" => 8]
    ->toArray();